# 10.2 Pandas Data Structure에 대한 연산

## 10.2.1 요소(들)의 Type 알아내고 바꾸기 ~.dtypes과 ~.astype()

In [61]:
import pandas as pd
import numpy as np

In [19]:
dic1 = {'이름': ['성춘향','이몽룡'],
        '보통예금': [2100,2700],
        '저축예금': [3400,4600]}

In [20]:
df1 = pd.DataFrame(dic1,index=[1012,1010])

In [21]:
df1

       이름  보통예금  저축예금
1012  성춘향  2100  3400
1010  이몽룡  2700  4600

In [22]:
df1.dtypes

이름      object
보통예금     int64
저축예금     int64
dtype: object

In [23]:
df1[['보통예금','저축예금']] = df1[['보통예금','저축예금']].astype(float)

In [24]:
df1.dtypes

이름       object
보통예금    float64
저축예금    float64
dtype: object

In [25]:
df1

       이름    보통예금    저축예금
1012  성춘향  2100.0  3400.0
1010  이몽룡  2700.0  4600.0

## 10.2.2 요소(들)의 포함 여부 판별 ~.isin(), ~.str.find()

In [26]:
df1.index.isin([1011])

array([False, False])

In [27]:
df1.columns.isin(['보통예금','정기예금'])

array([False,  True, False])

In [28]:
df1.columns.isin(['보통예금','저축예금'])

array([False,  True,  True])

In [29]:
df1.isin({'이름': ['이몽룡','홍길동']})

         이름   보통예금   저축예금
1012  False  False  False
1010   True  False  False

In [31]:
df1.isin({'이름': [2100.0,'홍길동']})

         이름   보통예금   저축예금
1012  False  False  False
1010  False  False  False

In [32]:
df1['이름'].isin(['이몽룡','홍길동'])

1012    False
1010     True
Name: 이름, dtype: bool

In [42]:
df1['이름'].str.find('이', 0) #0: searching을 시작하는 문자 위치

1012   -1
1010    0
Name: 이름, dtype: int64

In [43]:
df1['이름'].str.find('이', 1)

1012   -1
1010   -1
Name: 이름, dtype: int64

In [45]:
df1['이름'].str.find('몽') #시작위치의 default=0

1012   -1
1010    1
Name: 이름, dtype: int64

실행결과 중
-1: 그 위치에 있는 요소가 검색 문자를 포함하지 않음
0이상의 정수: 검색을 시작하는 문자위치로 부터 거리

In [46]:
df1['이씨'] = df1['이름'].str.find('이', end=1)
# end=1 검색을 마무리할 위치 즉 검색범위를 [0:1]로 제한

In [47]:
df1

       이름    보통예금    저축예금  이씨
1012  성춘향  2100.0  3400.0  -1
1010  이몽룡  2700.0  4600.0   0

## 10.2.3 중복된 data(row) 찾아내고 제거하기 ~.duplicated(), ~.drop_duplicates()

In [49]:
dic2 = {'Flower': ['Rose','Rose','Lily','Lily','Rose','Lily','Rose'],
        'Color': ['red','white','white','pink','red','pink','red'],
        'Size': ['L','S','S','L','L','L','S']}

In [50]:
df2 = pd.DataFrame(dic2);df2

  Flower  Color Size
0   Rose    red    L
1   Rose  white    S
2   Lily  white    S
3   Lily   pink    L
4   Rose    red    L
5   Lily   pink    L
6   Rose    red    S

In [51]:
df2.duplicated() #중복된 row

0    False
1    False
2    False
3    False
4     True
5     True
6    False
dtype: bool

4번째 5번째 row가 그전에 있는 data와 중복됨

In [52]:
df2.drop_duplicates()

  Flower  Color Size
0   Rose    red    L
1   Rose  white    S
2   Lily  white    S
3   Lily   pink    L
6   Rose    red    S

In [54]:
df2.drop_duplicates(['Flower','Color'])
# Size column과 상관없이 Flower와 Color에서 중복된 것을 제거

  Flower  Color Size
0   Rose    red    L
1   Rose  white    S
2   Lily  white    S
3   Lily   pink    L

## 10.2.4 Ranking ~.rank()

In [55]:
dic3 = {'이름': ['이몽룡','한석봉','성춘향','제갈량','관우'],
        '점수': [72,90,None,100,90]}

In [56]:
df3 = pd.DataFrame(dic3); df3

    이름     점수
0  이몽룡   72.0
1  한석봉   90.0
2  성춘향    NaN
3  제갈량  100.0
4   관우   90.0

In [58]:
df3['점수'] = df3['점수'].astype(float)
df3['default_rank'] = df3['점수'].rank()
df3['1st_rank'] = df3['점수'].rank(method='first')
df3['max_rank'] = df3['점수'].rank(method='max')
df3['NA_bottom'] = df3['점수'].rank(na_option='bottom')
df3['pct_rank'] = df3['점수'].rank(pct=True)
df3

    이름     점수  default_rank  1st_rank  max_rank  NA_bottom  pct_rank
0  이몽룡   72.0           1.0       1.0       1.0        1.0     0.250
1  한석봉   90.0           2.5       2.0       3.0        2.5     0.625
2  성춘향    NaN           NaN       NaN       NaN        5.0       NaN
3  제갈량  100.0           4.0       4.0       4.0        4.0     1.000
4   관우   90.0           2.5       3.0       3.0        2.5     0.625

df3['default_rank'] = df3['점수'].rank()
아무런 입력인자를 넣어주지 않으면 동점자의 순위를 평균으로 나타냄

method = 'first'/'min'/'max'
동점 중 첫번째 것을 앞선것으로 처리 / 매길수 있는 순위중 최소 / 최대

na_option = 'bottom'
NaN을 꼴등으로 원래 default는 그냥 NaN으로 표시하는것
#NaN: data를 불러올때 자리가 비어있으면 그 자리 값을 NaN으로 표시한다 즉 누락된값

pct = True
순위를 자연수대신 1로 정규화된 값으로 표시

## 10.2.5 Missing Data 찾아내고 처리하기 ~.isnull(), ~.dropna(), ~.fillna()

In [62]:
df4 = pd.DataFrame( [[4.1,None,np.nan,None],
                     [0.0,-1.0,2.5,None],
                     [3.3,2.7,None,None],
                     [None,None,None,None]],
                   columns=['A','B','C','D'])

In [63]:
df4

     A    B    C     D
0  4.1  NaN  NaN  None
1  0.0 -1.0  2.5  None
2  3.3  2.7  NaN  None
3  NaN  NaN  NaN  None

In [64]:
df4.isna()

       A      B      C     D
0  False   True   True  True
1  False  False  False  True
2  False  False   True  True
3   True   True   True  True

In [65]:
df4.notna()

       A      B      C      D
0   True  False  False  False
1   True   True   True  False
2   True   True  False  False
3  False  False  False  False

In [66]:
df4.dropna(how='all') #모든 요소가 NaN/None인 행 제거
#how='any' NaN/None이 하나라도 있는 행제거

     A    B    C     D
0  4.1  NaN  NaN  None
1  0.0 -1.0  2.5  None
2  3.3  2.7  NaN  None

In [67]:
df4.dropna(axis=1, how='all') #열 제거

     A    B    C
0  4.1  NaN  NaN
1  0.0 -1.0  2.5
2  3.3  2.7  NaN
3  NaN  NaN  NaN

In [68]:
df4.dropna(thresh=2) #3개 이상인 행만 삭제

     A    B    C     D
1  0.0 -1.0  2.5  None
2  3.3  2.7  NaN  None

In [70]:
df5 = {'data': [1,2,None,4,5,np.nan]}
df5 = pd.DataFrame(df5); df5

   data
0   1.0
1   2.0
2   NaN
3   4.0
4   5.0
5   NaN

In [71]:
df5['(0)'] = df5['data'].fillna(0)
# NaN을 0 으로 대체

In [72]:
df5['mean'] = df5['data'].fillna(df5['data'].mean())
# NaN을 평균값으로 대체

In [73]:
df5['ffill'] = df5['data'].fillna(method='ffill')
# NaN을 그 바로 전 요소의 값으로 대체

In [74]:
df5

   data  (0)  mean  ffill
0   1.0  1.0   1.0    1.0
1   2.0  2.0   2.0    2.0
2   NaN  0.0   3.0    2.0
3   4.0  4.0   4.0    4.0
4   5.0  5.0   5.0    5.0
5   NaN  0.0   3.0    5.0

## 10.2.6 Data값 바꾸기 ~.replace()

In [75]:
df7 = pd.DataFrame({'col1': ['A','A','B','B'],
                    'col2': ['a1','a2','b1','b2'],
                    'col3': [2,5,4,np.nan]})

In [76]:
df7

  col1 col2  col3
0    A   a1   2.0
1    A   a2   5.0
2    B   b1   4.0
3    B   b2   NaN

In [77]:
df7.replace(['a1','a2'],'a12')

  col1 col2  col3
0    A  a12   2.0
1    A  a12   5.0
2    B   b1   4.0
3    B   b2   NaN

In [78]:
df7.replace(['b1','b2'],['b_1','b_2'])

  col1 col2  col3
0    A   a1   2.0
1    A   a2   5.0
2    B  b_1   4.0
3    B  b_2   NaN

In [80]:
df7.replace({'b1':'b_1','b2':'b_2'})

  col1 col2  col3
0    A   a1   2.0
1    A   a2   5.0
2    B  b_1   4.0
3    B  b_2   NaN

In [81]:
df7.replace('a2',np.nan)

  col1 col2  col3
0    A   a1   2.0
1    A  NaN   5.0
2    B   b1   4.0
3    B   b2   NaN

In [83]:
df7.replace('a2',None)

  col1 col2  col3
0    A   a1   2.0
1    A   a1   5.0
2    B   b1   4.0
3    B   b2   NaN

In [84]:
df7.replace('a2',method='bfill')

  col1 col2  col3
0    A   a1   2.0
1    A   b1   5.0
2    B   b1   4.0
3    B   b2   NaN

In [87]:
df7.replace(np.nan, 0)

  col1 col2  col3
0    A   a1   2.0
1    A   a2   5.0
2    B   b1   4.0
3    B   b2   0.0

## 10.2.7 특정조건을 만족시키는 Data 찾기 ~.where()

In [88]:
filter = (df7['col1']=='A') & (df7['col3']>4)

In [89]:
df7.where(filter)

  col1 col2  col3
0  NaN  NaN   NaN
1    A   a2   5.0
2  NaN  NaN   NaN
3  NaN  NaN   NaN

In [95]:
df7[abs(df7['col3'])>4]

  col1 col2  col3
1    A   a2   5.0

In [96]:
inlier = lambda x: abs(x) <= 4

In [97]:
df7['col3'] = df7['col3'].where(inlier, np.nan); df7

  col1 col2  col3
0    A   a1   2.0
1    A   a2   NaN
2    B   b1   4.0
3    B   b2   NaN

## 10.2.8 합 / 평균 / 최소 / 최대치 구하기

In [104]:
df8 = pd.DataFrame([[4,2],
                    [9,3],
                    [-1,8],
                    [5,np.nan]],
                  columns=['A','B'],)

In [105]:
df8

   A    B
0  4  2.0
1  9  3.0
2 -1  8.0
3  5  NaN

In [106]:
df8.sum()

A    17.0
B    13.0
dtype: float64

In [108]:
df8.sum(skipna=False)

A    17.0
B     NaN
dtype: float64

In [109]:
df8.sum(axis=1)

0     6.0
1    12.0
2     7.0
3     5.0
dtype: float64

In [110]:
df8.max()

A    9.0
B    8.0
dtype: float64

In [111]:
df8.idxmax() #각 열의 최대값에 대한 index들

A    1
B    2
dtype: int64

In [113]:
df8.describe() # 각 열의 요소 개수, 평균, 표준편차, 최소값 등

              A         B
count  4.000000  3.000000
mean   4.250000  4.333333
std    4.112988  3.214550
min   -1.000000  2.000000
25%    2.750000  2.500000
50%    4.500000  3.000000
75%    6.000000  5.500000
max    9.000000  8.000000

## 10.2.9 Function 적용과 Mapping ~.apply(), ~.applymap(), ~.assign()

In [114]:
df8.apply(np.sum)

A    17.0
B    13.0
dtype: float64

In [115]:
df8.apply(np.sqrt)

          A         B
0  2.000000  1.414214
1  3.000000  1.732051
2       NaN  2.828427
3  2.236068       NaN

In [116]:
f = lambda x: max(x) - min(x)

In [117]:
df8.apply(f)

A    10.0
B     6.0
dtype: float64

In [118]:
f2 = lambda x: x**2

In [119]:
df8.apply(f2)

    A     B
0  16   4.0
1  81   9.0
2   1  64.0
3  25   NaN

In [120]:
df8**2

    A     B
0  16   4.0
1  81   9.0
2   1  64.0
3  25   NaN

In [121]:
format = lambda x: '%.2f' %x

In [122]:
df8.applymap(format)

       A     B
0   4.00  2.00
1   9.00  3.00
2  -1.00  8.00
3   5.00   nan

In [135]:
c2f = lambda x: x.B*2 + x.A #x.B는 x의 B열

In [136]:
df8_1 = df8.assign(C=c2f); df8_1

   A    B     C
0  4  2.0   8.0
1  9  3.0  15.0
2 -1  8.0  15.0
3  5  NaN   NaN

In [137]:
df8_2 = df8_1.copy()

In [140]:
df8_2['C'] = df8_2['C'].clip(9,16) #수의 범위를 (9,16) 구간으로 제한

In [141]:
df8_2

   A    B     C
0  4  2.0   9.0
1  9  3.0  15.0
2 -1  8.0  15.0
3  5  NaN   NaN

In [142]:
pd.options.display.float_format = '{:,.3f}'.format #모든 float을 소수점 세자리까지 표시

In [143]:
df8_2

   A     B      C
0  4 2.000  9.000
1  9 3.000 15.000
2 -1 8.000 15.000
3  5   NaN    NaN

## 10.2.10 Group별 Function 적용 ~.groupby(), ~.agg(), ~.apply(), ~.pivot_table()

In [144]:
df = pd.DataFrame({'State': ['CA','NY','NY','CA','NY','CA','CA','NY'],
                   'Gender': ['M','M','F','F','F','F','M','M'],
                   'Income': [21,17,23,32,25,14,29,18],
                   'Expense': [15,21,28,13,21,18,25,15]})

In [145]:
df['Revenue'] = df['Income'] - df['Expense']; df

  State Gender  Income  Expense  Revenue
0    CA      M      21       15        6
1    NY      M      17       21       -4
2    NY      F      23       28       -5
3    CA      F      32       13       19
4    NY      F      25       21        4
5    CA      F      14       18       -4
6    CA      M      29       25        4
7    NY      M      18       15        3

In [152]:
groups_G = df.groupby('Gender')

In [153]:
for name, group in groups_G:
    print(name); print(group)

F
  State Gender  Income  Expense  Revenue
2    NY      F      23       28       -5
3    CA      F      32       13       19
4    NY      F      25       21        4
5    CA      F      14       18       -4
M
  State Gender  Income  Expense  Revenue
0    CA      M      21       15        6
1    NY      M      17       21       -4
6    CA      M      29       25        4
7    NY      M      18       15        3

In [154]:
groups_G.get_group('M')

  State Gender  Income  Expense  Revenue
0    CA      M      21       15        6
1    NY      M      17       21       -4
6    CA      M      29       25        4
7    NY      M      18       15        3

In [155]:
groups_G.sum()

        Income  Expense  Revenue
Gender
F           94       80       14
M           85       76        9

In [156]:
groups_G.agg({'Income': 'sum',
              'Revenue': 'mean'})

        Income  Revenue
Gender
F           94    3.500
M           85    2.250

In [157]:
groups_G.agg(수입_합계=('Income','sum'),
             수익_평균=('Revenue','mean'))

        수입_합계  수익_평균
Gender
F          94  3.500
M          85  2.250

In [158]:
groups_G.apply(lambda x: x.describe())

              Income  Expense  Revenue
Gender
F      count   4.000    4.000    4.000
       mean   23.500   20.000    3.500
       std     7.416    6.272   11.091
       min    14.000   13.000   -5.000
       25%    20.750   16.750   -4.250
       50%    24.000   19.500    0.000
       75%    26.750   22.750    7.750
       max    32.000   28.000   19.000
M      count   4.000    4.000    4.000
       mean   21.250   19.000    2.250
       std     5.439    4.899    4.349
       min    17.000   15.000   -4.000
       25%    17.750   15.000    1.250
       50%    19.500   18.000    3.500
       75%    23.000   22.000    4.500
       max    29.000   25.000    6.000